title: 'OS Credential Dumping: Dump Volume Shadow Copy Hives with System.IO.File'
id: xxxxxxxx-xxxx-xxxx-xxxx-xxxxxxxxxxxx
status: test
author: 'Carlos Adriano'
description: 'Detects an attempt to dump hives from volume shadow copies using System.IO.File exploiting the HiveNightmare vulnerability.'
references:
  - 'https://attack.mitre.org/techniques/T1003/002'
  - 'https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-36934'
date: '2023-09-26'
tags:
  - 'T1003.002'
  - 'Credential Access'
logsource:
  product: 'windows'
  service: 'sysmon'
  category: 'process_creation'
detection:
  selection:
    Image: '*\powershell.exe'
    CommandLine: '[System.IO.File]::Copy*'
  condition: selection
falsepositives:
  - 'Authorized administrative activity'
level: 'high'
