title: 'OS Credential Dumping: Registry Parse with Pypykatz'
id: xxxxxxxx-xxxx-xxxx-xxxx-xxxxxxxxxxxx
status: test
author: 'Carlos Adriano'
description: 'Detects an attempt to parse registry hives to obtain stored credentials using pypykatz.'
references:
  - 'https://attack.mitre.org/techniques/T1003/002'
date: '2023-09-26'
tags:
  - 'T1003.002'
  - 'Credential Access'
logsource:
  product: 'windows'
  service: 'sysmon'
  category: 'process_creation'
detection:
  selection:
    Image: '*\pypykatz.exe'
    CommandLine: '*live registry*'
  condition: selection
falsepositives:
  - 'Authorized administrative activity'
level: 'high'
