title: 'Rootkit Baseado em Módulo de Kernel Carregável'
id: xxxxxxxx-xxxx-xxxx-xxxx-xxxxxxxxxxxx
status: test
author: 'Carlos Adriano'
description: 'Detecta uma tentativa de carregar um módulo de kernel usando modprobe para ocultar sua presença no sistema.'
references:
  - 'https://attack.mitre.org/techniques/T1014'
date: '2023-09-26'
tags:
  - 'T1014'
  - 'Persistence'
logsource:
  product: 'linux'
  service: 'auditd'
  category: 'process_creation'
detection:
  selection:
    exe: '/usr/sbin/modprobe'
  condition: selection
falsepositives:
  - 'Atividades administrativas autorizadas'
level: 'high'
