title: 'System Service Discovery via systemctl'
id: xxxxxxxx-xxxx-xxxx-xxxx-xxxxxxxxxxxx
status: test
author: 'Carlos Adriano'
description: 'Detecta a tentativa de descobrir serviços do sistema usando systemctl no Linux.'
references:
  - 'https://attack.mitre.org/techniques/T1007'
tags:
  - 'T1007'
  - 'System Service Discovery'
logsource:
  product: 'linux'
  service: 'auditd'
  category: 'process_creation'
detection:
  selection:
    Executable: '/usr/bin/systemctl'
    CommandLine: '--type=service'
  condition: selection
falsepositives:
  - 'Administração legítima do sistema e diagnóstico.'
level: 'medium'
