title: 'OS Credential Dumping: Cached Domain Credentials via Cmdkey'
id: xxxxxxxx-xxxx-xxxx-xxxx-xxxxxxxxxxxx
status: test
author: 'Carlos Adriano'
description: 'Detects an attempt to list cached credentials on the host using the built-in Windows utility cmdkey.exe. This can be used by adversaries to gather information about stored credentials.'
references:
  - 'https://attack.mitre.org/techniques/T1003/005'
  - 'https://docs.microsoft.com/en-us/windows-server/administration/windows-commands/cmdkey'
  - 'https://www.peew.pw/blog/2017/11/26/exploring-cmdkey-an-edge-case-for-privilege-escalation'
date: '2023-09-26'
tags:
  - 'T1003.005'
  - 'Credential Access'
logsource:
  product: 'windows'
  service: 'sysmon'
  category: 'process_creation'
detection:
  selection:
    Image: '*\cmdkey.exe'
    CommandLine: '/list'
  condition: selection
falsepositives:
  - 'Authorized administrative activity'
  - 'Legitimate use of cmdkey by users or applications'
level: 'medium'
