title: 'Criação de Processo via Consulta WMI e Comando Codificado | Behavior 07'
id: 'xxxxxxxx-xxxx-xxxx-xxxx-xxxxxxxxxxxx'
status: test
author: 'Carlos Adriano'
description: 'Detecta a criação de um processo usando uma consulta WMI e um comando codificado.'
references:
  - 'https://attack.mitre.org/techniques/T1047'
date: '2023-09-26'
tags:
  - 'T1047'
  - 'WMI'
logsource:
  product: 'windows'
  service: 'powershell'
  category: 'process_creation'
detection:
  selection:
    Image: 'C:\\Windows\\System32\\WindowsPowerShell\\v1.0\\powershell.exe'
    CommandLine: '*-exec bypass -e*'
  condition: selection
falsepositives:
  - 'Scripts administrativos legítimos que usam comandos codificados no PowerShell.'
level: 'medium'
