title: 'T1003.001 - Offline Credential Theft With Mimikatz'
id: xxxxxxxx-xxxx-xxxx-xxxx-xxxxxxxxxxxx
status: test
author: 'Carlos Adriano'
description: 'Detects an attempt to dump credentials from LSASS memory using Mimikatz.'
references:
  - 'https://attack.mitre.org/techniques/T1003/001'
date: '2023-09-26'
tags:
  - 'T1003.001'
  - 'Credential Access'
logsource:
  product: 'windows'
  service: 'security'
  category: 'process_creation'
detection:
  selection:
    Image: '*\mimikatz.exe'
    CommandLine: '*sekurlsa::logonpasswords*'
  condition: selection
falsepositives:
  - 'Authorized administrative activity'
level: 'high'
