title: 'T1003.001 - LSASS Memory Dump via NanoDump'
id: xxxxxxxx-xxxx-xxxx-xxxx-xxxxxxxxxxxx
status: test
author: 'Carlos Adriano'
description: 'Detects an attempt to dump LSASS memory using NanoDump.'
references:
  - 'https://attack.mitre.org/techniques/T1003/001'
  - 'https://github.com/helpsystems/nanodump'
date: '2023-09-26'
tags:
  - 'T1003.001'
  - 'Credential Access'
logsource:
  product: 'windows'
  service: 'sysmon'
  category: 'process_creation'
detection:
  selection:
    Image: '*\nanodump.x64.exe'
    CommandLine: '*-w*'
  condition: selection
falsepositives:
  - 'Authorized administrative activity'
level: 'high'
