title: 'T1003.001 - LSASS Memory Dump via Windows Task Manager'
id: xxxxxxxx-xxxx-xxxx-xxxx-xxxxxxxxxxxx
status: test
author: 'Carlos Adriano'
description: 'Detects an attempt to dump LSASS memory using Windows Task Manager.'
references:
  - 'https://attack.mitre.org/techniques/T1003/001'
date: '2023-09-26'
tags:
  - 'T1003.001'
  - 'Credential Access'
logsource:
  product: 'windows'
  service: 'security'
  category: 'process_creation'
detection:
  selection:
    ParentImage: '*\Taskmgr.exe'
    Image: '*\rundll32.exe'
    CommandLine: '*MiniDump*lsass*'
  condition: selection
falsepositives:
  - 'Authorized administrative activity'
level: 'high'
