title: 'Execução Remota de Código com Credenciais PS Usando Invoke-Command'
id: xxxxxxxx-xxxx-xxxx-xxxx-xxxxxxxxxxxx
status: test
author: 'Carlos Adriano'
description: 'Detecta uma tentativa de movimento lateral com PowerShell Remoting no host local. A execução bem-sucedida resultará na execução do comando "whoami" usando "Invoke-Command".'
references:
  - 'https://attack.mitre.org/techniques/T1021/006'
date: '2023-10-03'
tags:
  - 'T1021.006'
  - 'WinRM'
  - 'Invoke-Command'
logsource:
  product: 'windows'
  service: 'powershell'
  category: 'process'
detection:
  selection:
    CommandLine:
      - '*Invoke-Command -ComputerName $env:COMPUTERNAME -ScriptBlock {whoami}*'
  condition: selection
falsepositives:
  - 'Administração legítima do sistema.'
  - 'Uso autorizado do Invoke-Command por administradores.'
level: 'medium'
