title: 'Obfuscation de Arquivos ou Informações: Preenchimento Binário com dd'
id: xxxxxxxx-xxxx-xxxx-xxxx-xxxxxxxxxxxx
status: test
author: 'Carlos Adriano'
description: 'Detecção da utilização do comando dd para adicionar bytes a um binário com o objetivo de alterar seu hash. Adversários podem usar essa técnica para evitar detecções baseadas em hash.'
references:
  - 'https://attack.mitre.org/techniques/T1027/001'
date: '2023-10-03'
tags:
  - 'obfuscation'
  - 'file_modification'
logsource:
  product: 'linux'
  service: 'auditd'
detection:
  condition: command_line contains "dd" and (command_line contains "/dev/zero" or command_line contains "/dev/random" or command_line contains "/dev/urandom")
falsepositives:
  - 'Uso legítimo do comando dd para outras finalidades.'
level: 'medium'
