title: 'Adfind - Enumerate Active Directory Domain Controller Objects'
id: xxxxxxxx-xxxx-xxxx-xxxx-xxxxxxxxxxxx
status: test
author: 'Carlos Adriano'
description: 'Detects the use of Adfind tool to enumerate Domain Controllers within Active Directory.'
references:
  - 'https://attack.mitre.org/techniques/T1018'
date: '2023-09-26'
tags:
  - 'T1018'
logsource:
  product: 'windows'
  service: 'command_prompt'
  category: 'process_creation'
detection:
  selection:
    CommandLine: '*AdFind.exe* -sc dclist*'
  condition: selection
falsepositives:
  - 'Legitimate administrative activity'
level: 'medium'
