title: 'Get-DomainController with PowerView'
id: xxxxxxxx-xxxx-xxxx-xxxx-xxxxxxxxxxxx
status: test
author: 'Carlos Adriano'
description: 'Detects the use of PowerView to identify the Domain Controller within the domain.'
references:
  - 'https://attack.mitre.org/techniques/T1018'
date: '2023-09-26'
tags:
  - 'T1018'
logsource:
  product: 'windows'
  service: 'powershell'
  category: 'process_creation'
detection:
  selection:
    CommandLine: '*Get-DomainController*'
  condition: selection
falsepositives:
  - 'Legitimate administrative activity'
level: 'medium'
