title: 'Remote System Discovery - ip route'
id: xxxxxxxx-xxxx-xxxx-xxxx-xxxxxxxxxxxx
status: test
author: 'Carlos Adriano'
description: 'Detects the use of the ip route command to display the kernel's routing tables.'
references:
  - 'https://attack.mitre.org/techniques/T1018'
date: '2023-09-26'
tags:
  - 'T1018'
logsource:
  product: 'linux'
  service: 'shell'
  category: 'process_creation'
detection:
  selection:
    CommandLine: 'ip route show'
  condition: selection
falsepositives:
  - 'Network diagnostics'
level: 'low'
