title: 'OS Credential Dumping: Dumping LSA Secrets'
id: xxxxxxxx-xxxx-xxxx-xxxx-xxxxxxxxxxxx
status: test
author: 'Carlos Adriano'
description: 'Detects an attempt to dump LSA secrets from the Windows registry, which can contain sensitive credential materials.'
references:
  - 'https://attack.mitre.org/techniques/T1003/004'
  - 'https://pentestlab.blog/2018/04/04/dumping-clear-text-credentials/#:~:text=LSA%20Secrets%20is%20a%20registry,host%2C%20local%20security%20policy%20etc.'
date: '2023-09-26'
tags:
  - 'T1003.004'
  - 'Credential Access'
logsource:
  product: 'windows'
  service: 'sysmon'
  category: 'process_creation'
detection:
  selection:
    Image: '*\PsExec.exe'
    CommandLine: '-accepteula -s reg save HKLM\security\policy\secrets*'
  condition: selection
falsepositives:
  - 'Authorized administrative activity'
level: 'high'
