title: 'Movimento Lateral PowerShell Usando MMC20'
id: xxxxxxxx-xxxx-xxxx-xxxx-xxxxxxxxxxxx
status: test
author: 'Carlos Adriano'
description: 'Detecta uma tentativa de movimento lateral usando o objeto COM mmc20 através do PowerShell. Este comportamento pode indicar uma tentativa de executar comandos em um computador remoto usando DCOM.'
references:
  - 'https://attack.mitre.org/techniques/T1021/003'
  - 'https://blog.cobaltstrike.com/2017/01/24/scripting-matt-nelsons-mmc20-application-lateral-movement-technique/'
date: '2023-10-03'
tags:
  - 'T1021.003'
  - 'DCOM'
  - 'MMC20'
logsource:
  product: 'windows'
  service: 'powershell'
  category: 'process_creation'
detection:
  selection:
    CommandLine:
      - '*[activator]::CreateInstance([type]::GetTypeFromProgID("MMC20.application"*'
  condition: selection
falsepositives:
  - 'Administração legítima do sistema.'
  - 'Scripts autorizados que utilizam o objeto COM mmc20 para tarefas administrativas.'
level: 'high'
