title: 'Arquivos ou Informações Ofuscados: Software Empacotado com UPX no macOS'
id: xxxxxxxx-xxxx-xxxx-xxxx-xxxxxxxxxxxx
status: test
author: 'Carlos Adriano'
description: 'Detecção da utilização de binários empacotados com UPX no macOS. Adversários podem usar essa técnica para ocultar o código original do binário e evitar detecções baseadas em assinaturas.'
references:
  - 'https://attack.mitre.org/techniques/T1027/002'
date: '2023-10-03'
tags:
  - 'obfuscation'
  - 'file_execution'
logsource:
  product: 'macos'
  service: 'auditd'
detection:
  condition: command_line contains "/tmp/packed_bin"
falsepositives:
  - 'Uso legítimo de binários empacotados com UPX para fins não maliciosos.'
level: 'medium'
