title: 'Arquivos ou Informações Ofuscados: Software Empacotado com UPX e Cabeçalhos Modificados no Linux'
id: xxxxxxxx-xxxx-xxxx-xxxx-xxxxxxxxxxxx
status: test
author: 'Carlos Adriano'
description: 'Detecção da utilização de binários empacotados com UPX e com cabeçalhos modificados no Linux. A modificação dos cabeçalhos pode dificultar a detecção e descompressão do binário.'
references:
  - 'https://attack.mitre.org/techniques/T1027/002'
date: '2023-10-03'
tags:
  - 'obfuscation'
  - 'file_execution'
logsource:
  product: 'linux'
  service: 'auditd'
detection:
  condition: command_line contains "/tmp/packed_bin"
falsepositives:
  - 'Uso legítimo de binários empacotados com UPX com cabeçalhos modificados para fins não maliciosos.'
level: 'medium'
