title: 'OS Credential Dumping: DCSync (Active Directory)'
id: xxxxxxxx-xxxx-xxxx-xxxx-xxxxxxxxxxxx
status: test
author: 'Carlos Adriano'
description: 'Detecta uma tentativa de recuperar informações de conta do Active Directory sem acessar a memória ou recuperar o banco de dados NTDS. Isso funciona contra um controlador de domínio Windows remoto usando o protocolo de replicação.'
references:
  - 'https://attack.mitre.org/techniques/T1003/006'
  - 'https://adsecurity.org/?p=1729'
date: '2023-09-26'
tags:
  - 'T1003.006'
  - 'Credential Access'
logsource:
  product: 'windows'
  service: 'sysmon'
  category: 'process_creation'
detection:
  selection:
    Image: '*\mimikatz.exe'
    CommandLine: '*lsadump::dcsync*'
  condition: selection
falsepositives:
  - 'Atividades administrativas autorizadas'
  - 'Uso legítimo do mimikatz por usuários ou aplicações'
level: 'high'
