title: 'OS Credential Dumping: DSInternals Get-ADReplAccount'
id: xxxxxxxx-xxxx-xxxx-xxxx-xxxxxxxxxxxx
status: test
author: 'Carlos Adriano'
description: 'Detecta uma tentativa de executar Get-ADReplAccount do DSInternals. Após a execução bem-sucedida, o domínio e as credenciais aparecerão na saída padrão.'
references:
  - 'https://attack.mitre.org/techniques/T1003/006'
  - 'https://www.dsinternals.com/en/retrieving-active-directory-passwords-remotely/'
  - 'https://www.crowdstrike.com/blog/observations-from-the-stellarparticle-campaign/'
date: '2023-09-26'
tags:
  - 'T1003.006'
  - 'Credential Access'
logsource:
  product: 'windows'
  service: 'sysmon'
  category: 'process_creation'
detection:
  selection:
    CommandLine: '*Get-ADReplAccount*'
  condition: selection
falsepositives:
  - 'Atividades administrativas autorizadas'
  - 'Uso legítimo do DSInternals por usuários ou aplicações'
level: 'high'
