title: 'OS Credential Dumping: Create Volume Shadow Copy Remotely with WMI'
id: xxxxxxxx-xxxx-xxxx-xxxx-xxxxxxxxxxxx
status: test
author: 'Carlos Adriano'
description: 'Detects an attempt to create a volume shadow copy on a remote machine using WMI, which can be used to access the NTDS.dit file.'
references:
  - 'https://attack.mitre.org/techniques/T1003/003'
date: '2023-09-26'
tags:
  - 'T1003.003'
  - 'Credential Access'
logsource:
  product: 'windows'
  service: 'sysmon'
  category: 'process_creation'
detection:
  selection:
    Image: 'wmic.exe'
    CommandLine: '/node:* shadowcopy call create Volume=*'
  condition: selection
falsepositives:
  - 'Authorized administrative activity'
level: 'high'
